Revit 2027 API
ScheduleDefinition.AddField(ScheduleFieldType, ElementId) Method
 Adds a regular field at the end of the list.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ScheduleField AddField(
	ScheduleFieldType fieldType,
	ElementId parameterId
)
Public Function AddField (
	fieldType As ScheduleFieldType,
	parameterId As ElementId
) As ScheduleField
public:
ScheduleField^ AddField(
	ScheduleFieldType fieldType,
	ElementId^ parameterId
)
member AddField :
        fieldType : ScheduleFieldType *
        parameterId : ElementId -> ScheduleField
Parameters
fieldType ScheduleFieldType
 The type of data displayed by the field.
parameterId ElementId
 The ID of the parameter displayed by the field.
Return Value
ScheduleField
 The new field.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
ArgumentsInconsistentException |  The field specified by fieldType and parameterId may not included in this ScheduleDefinition. -or- The field specified by fieldType and parameterId is already included in this ScheduleDefinition.
See Also
Reference
ScheduleDefinition Class
AddField Overload
Autodesk.Revit.DB Namespace